{"config": [{"config": {"bias_constraint": null, "name": "conv2d_25", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "batch_input_shape": [null, 3, 32, 32], "activity_regularizer": null, "filters": 32, "padding": "same", "data_format": "channels_first", "activation": "linear", "dtype": "float32", "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_17", "trainable": true}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "name": "conv2d_26", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "use_bias": true, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "filters": 32, "padding": "same", "data_format": "channels_first", "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_18", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_11", "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_first", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_8", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "name": "conv2d_27", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "use_bias": true, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "filters": 64, "padding": "same", "data_format": "channels_first", "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_19", "trainable": true}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "name": "conv2d_28", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "use_bias": true, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "filters": 64, "padding": "valid", "data_format": "channels_first", "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_20", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_12", "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_first", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_9", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_9", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "name": "dense_11", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "units": 512, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_21", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_10", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "name": "dense_12", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "units": 10, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_22", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.4"}